
  x Type
   ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:3:1]
 3 | if (o2?.f(x)) {
   :           ^
   `----

Error: 
  > (string | number)

  x Type
   ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:3:1]
 3 | if (o2?.f(x)) {
   :     ^^
   `----

Error: 
  > ({
  |     f(x: any): x is number;
  | } | undefined)

  x Type
   ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:3:1]
 3 | if (o2?.f(x)) {
   :     ^^^^^
   `----

Error: 
  > (undefined | (x: any) => x is number)

  x Type
   ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:3:1]
 3 | if (o2?.f(x)) {
   :     ^^^^^^^^
   `----

Error: 
  > x is number

  x Type
   ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:4:5]
 4 | x; // number
   : ^
   `----

Error: 
  > number

  x Type
   ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:5:5]
 5 | o2.f; // (x: any) => x is number
   : ^^
   `----

Error: 
  > {
  |     f(x: any): x is number;
  | }

  x Type
   ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:5:5]
 5 | o2.f; // (x: any) => x is number
   : ^^^^
   `----

Error: 
  > (x: any) => x is number

  x Type
   ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:6:5]
 6 | o2?.f;
   : ^^
   `----

Error: 
  > {
  |     f(x: any): x is number;
  | }

  x Type
   ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:6:5]
 6 | o2?.f;
   : ^^^^^
   `----

Error: 
  > (x: any) => x is number

  x Type
   ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:7:5]
 7 | o2?.f(x);
   :       ^
   `----

Error: 
  > number

  x Type
   ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:7:5]
 7 | o2?.f(x);
   : ^^
   `----

Error: 
  > {
  |     f(x: any): x is number;
  | }

  x Type
   ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:7:5]
 7 | o2?.f(x);
   : ^^^^^
   `----

Error: 
  > (x: any) => x is number

  x Type
   ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:7:5]
 7 | o2?.f(x);
   : ^^^^^^^^
   `----

Error: 
  > x is number

  x Type
    ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:10:5]
 10 | x;
    : ^
    `----

Error: 
  > string

  x Type
    ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:11:5]
 11 | o2;
    : ^^
    `----

Error: 
  > ({
  |     f(x: any): x is number;
  | } | undefined)

  x Type
    ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:12:5]
 12 | o2?.f;
    : ^^
    `----

Error: 
  > ({
  |     f(x: any): x is number;
  | } | undefined)

  x Type
    ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:12:5]
 12 | o2?.f;
    : ^^^^^
    `----

Error: 
  > (undefined | (x: any) => x is number)

  x Type
    ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:13:5]
 13 | o2.f;
    : ^^
    `----

Error: 
  > ({
  |     f(x: any): x is number;
  | } | undefined)

  x Type
    ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:13:5]
 13 | o2.f;
    : ^^^^
    `----

Error: 
  > (x: any) => x is number

  x Type
    ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:15:1]
 15 | x;
    : ^
    `----

Error: 
  > (string | number)

  x Type
    ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:16:1]
 16 | o2;
    : ^^
    `----

Error: 
  > ({
  |     f(x: any): x is number;
  | } | undefined)

  x Type
    ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:17:1]
 17 | o2?.f;
    : ^^
    `----

Error: 
  > ({
  |     f(x: any): x is number;
  | } | undefined)

  x Type
    ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:17:1]
 17 | o2?.f;
    : ^^^^^
    `----

Error: 
  > (undefined | (x: any) => x is number)

  x Type
    ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:18:1]
 18 | o2.f;
    : ^^
    `----

Error: 
  > ({
  |     f(x: any): x is number;
  | } | undefined)

  x Type
    ,-[$DIR/tests/pass/types/predicate/controlFlowOptionalChain/2.ts:18:1]
 18 | o2.f;
    : ^^^^
    `----

Error: 
  > (x: any) => x is number
